// Дано натуральное число в диапазоне от 1 до 100 000.
// создайте массив, состоящий из цифр этого числа.
// Старший разряд числа должен распологаться на 0-ом
//  индексе массива, младший на последнем. Размер
// массива должен быть равен количеству цифр.

Console.Write("Введите число от 1 до 100 000: ");
int number = Convert.ToInt32(Console.ReadLine());

